In [2]:
import pandas as pd
import numpy as np

In [3]:
#sorting the data into dataframes using pandas
salaries_df = pd.read_csv('Salaries.csv')
team_df = pd.read_csv('Teams.csv')

In [4]:
#top 5 rows of dataframe
print(salaries_df.head(5))
print(team_df.head(5))

   yearID teamID lgID   playerID   salary
0    1985    BAL   AL  murraed02  1472819
1    1985    BAL   AL   lynnfr01  1090000
2    1985    BAL   AL  ripkeca01   800000
3    1985    BAL   AL   lacyle01   725000
4    1985    BAL   AL  flanami01   641667
   yearID lgID teamID franchID divID  Rank   G  Ghome   W   L     ...       \
0    1871  NaN    PH1      PNA   NaN     1  28    NaN  21   7     ...
1    1871  NaN    CH1      CNA   NaN     2  28    NaN  19   9     ...
2    1871  NaN    BS1      BNA   NaN     3  31    NaN  20  10     ...
3    1871  NaN    WS3      OLY   NaN     4  32    NaN  15  15     ...
4    1871  NaN    NY2      NNA   NaN     5  33    NaN  16  17     ...

   DP    FP                     name                      park  attendance  \
0 NaN  0.84   Philadelphia Athletics  Jefferson Street Grounds         NaN
1 NaN  0.82  Chicago White Stockings   Union Base-Ball Grounds         NaN
2 NaN  0.83     Boston Red Stockings       South End Grounds I         NaN
3 NaN  0.85      Washington Olympics          Olympics Grounds         NaN
4 NaN  0.83         New York Mutuals  Union Grounds (Brooklyn)         NaN

   BPF  PPF  teamIDBR  teamIDlahman45  teamIDretro
0  102   98       ATH             PH1          PH1
1  104  102       CHI             CH1          CH1
2  103   98       BOS             BS1          BS1
3   94   98       OLY             WS3          WS3
4   90   88       NYU             NY2          NY2

[5 rows x 48 columns]

In [5]:
from pandas import Series, DataFrame
#counts the number of values under teamID column
TeamID_series = salaries_df['teamID'].count()
print(TeamID_series)

23956

In [6]:
print(salaries_df.groupby('teamID'))

<pandas.core.groupby.DataFrameGroupBy object at 0x7f45f07fe048>

In [7]:
print(salaries_df['teamID'])
#prints max salary from MIA team
print(salaries_df['salary'][salaries_df['teamID']== 'MIA'].max())

0        BAL
1        BAL
2        BAL
3        BAL
4        BAL
5        BAL
6        BAL
7        BAL
8        BAL
9        BAL
10       BAL
11       BAL
12       BAL
13       BAL
14       BAL
15       BAL
16       BAL
17       BAL
18       BAL
19       BAL
20       BAL
21       BAL
22       BOS
23       BOS
24       BOS
25       BOS
26       BOS
27       BOS
28       BOS
29       BOS
        ...
23926    SLN
23927    SLN
23928    SLN
23929    SLN
23930    SLN
23931    WAS
23932    WAS
23933    WAS
23934    WAS
23935    WAS
23936    WAS
23937    WAS
23938    WAS
23939    WAS
23940    WAS
23941    WAS
23942    WAS
23943    WAS
23944    WAS
23945    WAS
23946    WAS
23947    WAS
23948    WAS
23949    WAS
23950    WAS
23951    WAS
23952    WAS
23953    WAS
23954    WAS
23955    WAS
Name: teamID, Length: 23956, dtype: object
19000000

In [8]:
print(salaries_df['teamID'][0])

BAL

In [9]:
teamID_list = []
#iterating through team column to create as list of all the different baseball teams
for i in range(23956):
    if salaries_df['teamID'][i] not in teamID_list:
        teamID_list.append(salaries_df['teamID'][i])
print(teamID_list)
print(len(teamID_list))

['BAL', 'BOS', 'CAL', 'CHA', 'CLE', 'DET', 'KCA', 'MIN', 'ML4', 'NYA', 'OAK', 'SEA', 'TEX', 'TOR', 'ATL', 'CHN', 'CIN', 'HOU', 'LAN', 'MON', 'NYN', 'PHI', 'PIT', 'SDN', 'SFN', 'SLN', 'COL', 'FLO', 'ANA', 'TBA', 'ARI', 'MIL', 'LAA', 'WAS', 'MIA']
35

In [10]:
#prints sum of salaries of every team
for item in teamID_list:
    TeamSalarySum = salaries_df['salary'][salaries_df['teamID']== item].sum()
    print(item + ' ' + str(TeamSalarySum))

BAL 1526784038
BOS 2293681006
CAL 271978930
CHA 1618034643
CLE 1322864229
DET 1618342187
KCA 1102872893
MIN 1186474624
ML4 233645804
NYA 3085575427
OAK 1114146053
SEA 1580612331
TEX 1557835439
TOR 1460955253
ATL 1785337784
CHN 1794310815
CIN 1326557848
HOU 1372976857
LAN 2020752103
MON 408203761
NYN 1934987231
PHI 1801410833
PIT 917369218
SDN 1101814262
SFN 1676242921
SLN 1654938332
COL 1198507139
FLO 675016005
ANA 468091973
TBA 695421775
ARI 1112113728
MIL 946944053
LAA 1062683436
WAS 583376341
MIA 151679900

In [11]:
#prints number of times each team is mentioned in the dataframe
print(salaries_df['teamID'].value_counts())

CLE    867
LAN    861
PHI    861
SLN    858
BAL    855
NYA    855
OAK    855
BOS    852
PIT    851
KCA    849
CIN    846
ATL    838
SDN    836
NYN    835
TEX    831
TOR    826
CHN    821
SFN    820
SEA    818
DET    817
CHA    812
HOU    805
MIN    778
COL    616
FLO    588
MON    577
ARI    458
TBA    455
MIL    452
ML4    381
CAL    368
WAS    260
LAA    256
ANA    247
MIA     51
Name: teamID, dtype: int64

In [12]:
print(salaries_df.groupby(['teamID','yearID']).groups.keys())

dict_keys([('ANA', 1997), ('ANA', 1998), ('ANA', 1999), ('ANA', 2000), ('ANA', 2001), ('ANA', 2002), ('ANA', 2003), ('ANA', 2004), ('ARI', 1998), ('ARI', 1999), ('ARI', 2000), ('ARI', 2001), ('ARI', 2002), ('ARI', 2003), ('ARI', 2004), ('ARI', 2005), ('ARI', 2006), ('ARI', 2007), ('ARI', 2008), ('ARI', 2009), ('ARI', 2010), ('ARI', 2011), ('ARI', 2012), ('ARI', 2013), ('ATL', 1985), ('ATL', 1986), ('ATL', 1987), ('ATL', 1988), ('ATL', 1989), ('ATL', 1990), ('ATL', 1991), ('ATL', 1992), ('ATL', 1993), ('ATL', 1994), ('ATL', 1995), ('ATL', 1996), ('ATL', 1997), ('ATL', 1998), ('ATL', 1999), ('ATL', 2000), ('ATL', 2001), ('ATL', 2002), ('ATL', 2003), ('ATL', 2004), ('ATL', 2005), ('ATL', 2006), ('ATL', 2007), ('ATL', 2008), ('ATL', 2009), ('ATL', 2010), ('ATL', 2011), ('ATL', 2012), ('ATL', 2013), ('BAL', 1985), ('BAL', 1986), ('BAL', 1987), ('BAL', 1988), ('BAL', 1989), ('BAL', 1990), ('BAL', 1991), ('BAL', 1992), ('BAL', 1993), ('BAL', 1994), ('BAL', 1995), ('BAL', 1996), ('BAL', 1997), ('BAL', 1998), ('BAL', 1999), ('BAL', 2000), ('BAL', 2001), ('BAL', 2002), ('BAL', 2003), ('BAL', 2004), ('BAL', 2005), ('BAL', 2006), ('BAL', 2007), ('BAL', 2008), ('BAL', 2009), ('BAL', 2010), ('BAL', 2011), ('BAL', 2012), ('BAL', 2013), ('BOS', 1985), ('BOS', 1986), ('BOS', 1987), ('BOS', 1988), ('BOS', 1989), ('BOS', 1990), ('BOS', 1991), ('BOS', 1992), ('BOS', 1993), ('BOS', 1994), ('BOS', 1995), ('BOS', 1996), ('BOS', 1997), ('BOS', 1998), ('BOS', 1999), ('BOS', 2000), ('BOS', 2001), ('BOS', 2002), ('BOS', 2003), ('BOS', 2004), ('BOS', 2005), ('BOS', 2006), ('BOS', 2007), ('BOS', 2008), ('BOS', 2009), ('BOS', 2010), ('BOS', 2011), ('BOS', 2012), ('BOS', 2013), ('CAL', 1985), ('CAL', 1986), ('CAL', 1987), ('CAL', 1988), ('CAL', 1989), ('CAL', 1990), ('CAL', 1991), ('CAL', 1992), ('CAL', 1993), ('CAL', 1994), ('CAL', 1995), ('CAL', 1996), ('CHA', 1985), ('CHA', 1986), ('CHA', 1987), ('CHA', 1988), ('CHA', 1989), ('CHA', 1990), ('CHA', 1991), ('CHA', 1992), ('CHA', 1993), ('CHA', 1994), ('CHA', 1995), ('CHA', 1996), ('CHA', 1997), ('CHA', 1998), ('CHA', 1999), ('CHA', 2000), ('CHA', 2001), ('CHA', 2002), ('CHA', 2003), ('CHA', 2004), ('CHA', 2005), ('CHA', 2006), ('CHA', 2007), ('CHA', 2008), ('CHA', 2009), ('CHA', 2010), ('CHA', 2011), ('CHA', 2012), ('CHA', 2013), ('CHN', 1985), ('CHN', 1986), ('CHN', 1987), ('CHN', 1988), ('CHN', 1989), ('CHN', 1990), ('CHN', 1991), ('CHN', 1992), ('CHN', 1993), ('CHN', 1994), ('CHN', 1995), ('CHN', 1996), ('CHN', 1997), ('CHN', 1998), ('CHN', 1999), ('CHN', 2000), ('CHN', 2001), ('CHN', 2002), ('CHN', 2003), ('CHN', 2004), ('CHN', 2005), ('CHN', 2006), ('CHN', 2007), ('CHN', 2008), ('CHN', 2009), ('CHN', 2010), ('CHN', 2011), ('CHN', 2012), ('CHN', 2013), ('CIN', 1985), ('CIN', 1986), ('CIN', 1987), ('CIN', 1988), ('CIN', 1989), ('CIN', 1990), ('CIN', 1991), ('CIN', 1992), ('CIN', 1993), ('CIN', 1994), ('CIN', 1995), ('CIN', 1996), ('CIN', 1997), ('CIN', 1998), ('CIN', 1999), ('CIN', 2000), ('CIN', 2001), ('CIN', 2002), ('CIN', 2003), ('CIN', 2004), ('CIN', 2005), ('CIN', 2006), ('CIN', 2007), ('CIN', 2008), ('CIN', 2009), ('CIN', 2010), ('CIN', 2011), ('CIN', 2012), ('CIN', 2013), ('CLE', 1985), ('CLE', 1986), ('CLE', 1987), ('CLE', 1988), ('CLE', 1989), ('CLE', 1990), ('CLE', 1991), ('CLE', 1992), ('CLE', 1993), ('CLE', 1994), ('CLE', 1995), ('CLE', 1996), ('CLE', 1997), ('CLE', 1998), ('CLE', 1999), ('CLE', 2000), ('CLE', 2001), ('CLE', 2002), ('CLE', 2003), ('CLE', 2004), ('CLE', 2005), ('CLE', 2006), ('CLE', 2007), ('CLE', 2008), ('CLE', 2009), ('CLE', 2010), ('CLE', 2011), ('CLE', 2012), ('CLE', 2013), ('COL', 1993), ('COL', 1994), ('COL', 1995), ('COL', 1996), ('COL', 1997), ('COL', 1998), ('COL', 1999), ('COL', 2000), ('COL', 2001), ('COL', 2002), ('COL', 2003), ('COL', 2004), ('COL', 2005), ('COL', 2006), ('COL', 2007), ('COL', 2008), ('COL', 2009), ('COL', 2010), ('COL', 2011), ('COL', 2012), ('COL', 2013), ('DET', 1985), ('DET', 1986), ('DET', 1987), ('DET', 1988), ('DET', 1989), ('DET', 1990), ('DET', 1991), ('DET', 1992), ('DET', 1993), ('DET', 1994), ('DET', 1995), ('DET', 1996), ('DET', 1997), ('DET', 1998), ('DET', 1999), ('DET', 2000), ('DET', 2001), ('DET', 2002), ('DET', 2003), ('DET', 2004), ('DET', 2005), ('DET', 2006), ('DET', 2007), ('DET', 2008), ('DET', 2009), ('DET', 2010), ('DET', 2011), ('DET', 2012), ('DET', 2013), ('FLO', 1993), ('FLO', 1994), ('FLO', 1995), ('FLO', 1996), ('FLO', 1997), ('FLO', 1998), ('FLO', 1999), ('FLO', 2000), ('FLO', 2001), ('FLO', 2002), ('FLO', 2003), ('FLO', 2004), ('FLO', 2005), ('FLO', 2006), ('FLO', 2007), ('FLO', 2008), ('FLO', 2009), ('FLO', 2010), ('FLO', 2011), ('HOU', 1985), ('HOU', 1986), ('HOU', 1987), ('HOU', 1988), ('HOU', 1989), ('HOU', 1990), ('HOU', 1991), ('HOU', 1992), ('HOU', 1993), ('HOU', 1994), ('HOU', 1995), ('HOU', 1996), ('HOU', 1997), ('HOU', 1998), ('HOU', 1999), ('HOU', 2000), ('HOU', 2001), ('HOU', 2002), ('HOU', 2003), ('HOU', 2004), ('HOU', 2005), ('HOU', 2006), ('HOU', 2007), ('HOU', 2008), ('HOU', 2009), ('HOU', 2010), ('HOU', 2011), ('HOU', 2012), ('HOU', 2013), ('KCA', 1985), ('KCA', 1986), ('KCA', 1987), ('KCA', 1988), ('KCA', 1989), ('KCA', 1990), ('KCA', 1991), ('KCA', 1992), ('KCA', 1993), ('KCA', 1994), ('KCA', 1995), ('KCA', 1996), ('KCA', 1997), ('KCA', 1998), ('KCA', 1999), ('KCA', 2000), ('KCA', 2001), ('KCA', 2002), ('KCA', 2003), ('KCA', 2004), ('KCA', 2005), ('KCA', 2006), ('KCA', 2007), ('KCA', 2008), ('KCA', 2009), ('KCA', 2010), ('KCA', 2011), ('KCA', 2012), ('KCA', 2013), ('LAA', 2005), ('LAA', 2006), ('LAA', 2007), ('LAA', 2008), ('LAA', 2009), ('LAA', 2010), ('LAA', 2011), ('LAA', 2012), ('LAA', 2013), ('LAN', 1985), ('LAN', 1986), ('LAN', 1987), ('LAN', 1988), ('LAN', 1989), ('LAN', 1990), ('LAN', 1991), ('LAN', 1992), ('LAN', 1993), ('LAN', 1994), ('LAN', 1995), ('LAN', 1996), ('LAN', 1997), ('LAN', 1998), ('LAN', 1999), ('LAN', 2000), ('LAN', 2001), ('LAN', 2002), ('LAN', 2003), ('LAN', 2004), ('LAN', 2005), ('LAN', 2006), ('LAN', 2007), ('LAN', 2008), ('LAN', 2009), ('LAN', 2010), ('LAN', 2011), ('LAN', 2012), ('LAN', 2013), ('MIA', 2012), ('MIA', 2013), ('MIL', 1998), ('MIL', 1999), ('MIL', 2000), ('MIL', 2001), ('MIL', 2002), ('MIL', 2003), ('MIL', 2004), ('MIL', 2005), ('MIL', 2006), ('MIL', 2007), ('MIL', 2008), ('MIL', 2009), ('MIL', 2010), ('MIL', 2011), ('MIL', 2012), ('MIL', 2013), ('MIN', 1985), ('MIN', 1986), ('MIN', 1987), ('MIN', 1988), ('MIN', 1989), ('MIN', 1990), ('MIN', 1991), ('MIN', 1992), ('MIN', 1993), ('MIN', 1994), ('MIN', 1995), ('MIN', 1996), ('MIN', 1997), ('MIN', 1998), ('MIN', 1999), ('MIN', 2000), ('MIN', 2001), ('MIN', 2002), ('MIN', 2003), ('MIN', 2004), ('MIN', 2005), ('MIN', 2006), ('MIN', 2007), ('MIN', 2008), ('MIN', 2009), ('MIN', 2010), ('MIN', 2011), ('MIN', 2012), ('MIN', 2013), ('ML4', 1985), ('ML4', 1986), ('ML4', 1987), ('ML4', 1988), ('ML4', 1989), ('ML4', 1990), ('ML4', 1991), ('ML4', 1992), ('ML4', 1993), ('ML4', 1994), ('ML4', 1995), ('ML4', 1996), ('ML4', 1997), ('MON', 1985), ('MON', 1986), ('MON', 1987), ('MON', 1988), ('MON', 1989), ('MON', 1990), ('MON', 1991), ('MON', 1992), ('MON', 1993), ('MON', 1994), ('MON', 1995), ('MON', 1996), ('MON', 1997), ('MON', 1998), ('MON', 1999), ('MON', 2000), ('MON', 2001), ('MON', 2002), ('MON', 2003), ('MON', 2004), ('NYA', 1985), ('NYA', 1986), ('NYA', 1987), ('NYA', 1988), ('NYA', 1989), ('NYA', 1990), ('NYA', 1991), ('NYA', 1992), ('NYA', 1993), ('NYA', 1994), ('NYA', 1995), ('NYA', 1996), ('NYA', 1997), ('NYA', 1998), ('NYA', 1999), ('NYA', 2000), ('NYA', 2001), ('NYA', 2002), ('NYA', 2003), ('NYA', 2004), ('NYA', 2005), ('NYA', 2006), ('NYA', 2007), ('NYA', 2008), ('NYA', 2009), ('NYA', 2010), ('NYA', 2011), ('NYA', 2012), ('NYA', 2013), ('NYN', 1985), ('NYN', 1986), ('NYN', 1987), ('NYN', 1988), ('NYN', 1989), ('NYN', 1990), ('NYN', 1991), ('NYN', 1992), ('NYN', 1993), ('NYN', 1994), ('NYN', 1995), ('NYN', 1996), ('NYN', 1997), ('NYN', 1998), ('NYN', 1999), ('NYN', 2000), ('NYN', 2001), ('NYN', 2002), ('NYN', 2003), ('NYN', 2004), ('NYN', 2005), ('NYN', 2006), ('NYN', 2007), ('NYN', 2008), ('NYN', 2009), ('NYN', 2010), ('NYN', 2011), ('NYN', 2012), ('NYN', 2013), ('OAK', 1985), ('OAK', 1986), ('OAK', 1987), ('OAK', 1988), ('OAK', 1989), ('OAK', 1990), ('OAK', 1991), ('OAK', 1992), ('OAK', 1993), ('OAK', 1994), ('OAK', 1995), ('OAK', 1996), ('OAK', 1997), ('OAK', 1998), ('OAK', 1999), ('OAK', 2000), ('OAK', 2001), ('OAK', 2002), ('OAK', 2003), ('OAK', 2004), ('OAK', 2005), ('OAK', 2006), ('OAK', 2007), ('OAK', 2008), ('OAK', 2009), ('OAK', 2010), ('OAK', 2011), ('OAK', 2012), ('OAK', 2013), ('PHI', 1985), ('PHI', 1986), ('PHI', 1987), ('PHI', 1988), ('PHI', 1989), ('PHI', 1990), ('PHI', 1991), ('PHI', 1992), ('PHI', 1993), ('PHI', 1994), ('PHI', 1995), ('PHI', 1996), ('PHI', 1997), ('PHI', 1998), ('PHI', 1999), ('PHI', 2000), ('PHI', 2001), ('PHI', 2002), ('PHI', 2003), ('PHI', 2004), ('PHI', 2005), ('PHI', 2006), ('PHI', 2007), ('PHI', 2008), ('PHI', 2009), ('PHI', 2010), ('PHI', 2011), ('PHI', 2012), ('PHI', 2013), ('PIT', 1985), ('PIT', 1986), ('PIT', 1987), ('PIT', 1988), ('PIT', 1989), ('PIT', 1990), ('PIT', 1991), ('PIT', 1992), ('PIT', 1993), ('PIT', 1994), ('PIT', 1995), ('PIT', 1996), ('PIT', 1997), ('PIT', 1998), ('PIT', 1999), ('PIT', 2000), ('PIT', 2001), ('PIT', 2002), ('PIT', 2003), ('PIT', 2004), ('PIT', 2005), ('PIT', 2006), ('PIT', 2007), ('PIT', 2008), ('PIT', 2009), ('PIT', 2010), ('PIT', 2011), ('PIT', 2012), ('PIT', 2013), ('SDN', 1985), ('SDN', 1986), ('SDN', 1987), ('SDN', 1988), ('SDN', 1989), ('SDN', 1990), ('SDN', 1991), ('SDN', 1992), ('SDN', 1993), ('SDN', 1994), ('SDN', 1995), ('SDN', 1996), ('SDN', 1997), ('SDN', 1998), ('SDN', 1999), ('SDN', 2000), ('SDN', 2001), ('SDN', 2002), ('SDN', 2003), ('SDN', 2004), ('SDN', 2005), ('SDN', 2006), ('SDN', 2007), ('SDN', 2008), ('SDN', 2009), ('SDN', 2010), ('SDN', 2011), ('SDN', 2012), ('SDN', 2013), ('SEA', 1985), ('SEA', 1986), ('SEA', 1987), ('SEA', 1988), ('SEA', 1989), ('SEA', 1990), ('SEA', 1991), ('SEA', 1992), ('SEA', 1993), ('SEA', 1994), ('SEA', 1995), ('SEA', 1996), ('SEA', 1997), ('SEA', 1998), ('SEA', 1999), ('SEA', 2000), ('SEA', 2001), ('SEA', 2002), ('SEA', 2003), ('SEA', 2004), ('SEA', 2005), ('SEA', 2006), ('SEA', 2007), ('SEA', 2008), ('SEA', 2009), ('SEA', 2010), ('SEA', 2011), ('SEA', 2012), ('SEA', 2013), ('SFN', 1985), ('SFN', 1986), ('SFN', 1987), ('SFN', 1988), ('SFN', 1989), ('SFN', 1990), ('SFN', 1991), ('SFN', 1992), ('SFN', 1993), ('SFN', 1994), ('SFN', 1995), ('SFN', 1996), ('SFN', 1997), ('SFN', 1998), ('SFN', 1999), ('SFN', 2000), ('SFN', 2001), ('SFN', 2002), ('SFN', 2003), ('SFN', 2004), ('SFN', 2005), ('SFN', 2006), ('SFN', 2007), ('SFN', 2008), ('SFN', 2009), ('SFN', 2010), ('SFN', 2011), ('SFN', 2012), ('SFN', 2013), ('SLN', 1985), ('SLN', 1986), ('SLN', 1987), ('SLN', 1988), ('SLN', 1989), ('SLN', 1990), ('SLN', 1991), ('SLN', 1992), ('SLN', 1993), ('SLN', 1994), ('SLN', 1995), ('SLN', 1996), ('SLN', 1997), ('SLN', 1998), ('SLN', 1999), ('SLN', 2000), ('SLN', 2001), ('SLN', 2002), ('SLN', 2003), ('SLN', 2004), ('SLN', 2005), ('SLN', 2006), ('SLN', 2007), ('SLN', 2008), ('SLN', 2009), ('SLN', 2010), ('SLN', 2011), ('SLN', 2012), ('SLN', 2013), ('TBA', 1998), ('TBA', 1999), ('TBA', 2000), ('TBA', 2001), ('TBA', 2002), ('TBA', 2003), ('TBA', 2004), ('TBA', 2005), ('TBA', 2006), ('TBA', 2007), ('TBA', 2008), ('TBA', 2009), ('TBA', 2010), ('TBA', 2011), ('TBA', 2012), ('TBA', 2013), ('TEX', 1985), ('TEX', 1986), ('TEX', 1987), ('TEX', 1988), ('TEX', 1989), ('TEX', 1990), ('TEX', 1991), ('TEX', 1992), ('TEX', 1993), ('TEX', 1994), ('TEX', 1995), ('TEX', 1996), ('TEX', 1997), ('TEX', 1998), ('TEX', 1999), ('TEX', 2000), ('TEX', 2001), ('TEX', 2002), ('TEX', 2003), ('TEX', 2004), ('TEX', 2005), ('TEX', 2006), ('TEX', 2007), ('TEX', 2008), ('TEX', 2009), ('TEX', 2010), ('TEX', 2011), ('TEX', 2012), ('TEX', 2013), ('TOR', 1985), ('TOR', 1986), ('TOR', 1987), ('TOR', 1988), ('TOR', 1989), ('TOR', 1990), ('TOR', 1991), ('TOR', 1992), ('TOR', 1993), ('TOR', 1994), ('TOR', 1995), ('TOR', 1996), ('TOR', 1997), ('TOR', 1998), ('TOR', 1999), ('TOR', 2000), ('TOR', 2001), ('TOR', 2002), ('TOR', 2003), ('TOR', 2004), ('TOR', 2005), ('TOR', 2006), ('TOR', 2007), ('TOR', 2008), ('TOR', 2009), ('TOR', 2010), ('TOR', 2011), ('TOR', 2012), ('TOR', 2013), ('WAS', 2005), ('WAS', 2006), ('WAS', 2007), ('WAS', 2008), ('WAS', 2009), ('WAS', 2010), ('WAS', 2011), ('WAS', 2012), ('WAS', 2013)])

In [13]:
#prints the sum of salaries of each team
print(salaries_df.groupby('teamID')['salary'].sum())

teamID
ANA     468091973
ARI    1112113728
ATL    1785337784
BAL    1526784038
BOS    2293681006
CAL     271978930
CHA    1618034643
CHN    1794310815
CIN    1326557848
CLE    1322864229
COL    1198507139
DET    1618342187
FLO     675016005
HOU    1372976857
KCA    1102872893
LAA    1062683436
LAN    2020752103
MIA     151679900
MIL     946944053
MIN    1186474624
ML4     233645804
MON     408203761
NYA    3085575427
NYN    1934987231
OAK    1114146053
PHI    1801410833
PIT     917369218
SDN    1101814262
SEA    1580612331
SFN    1676242921
SLN    1654938332
TBA     695421775
TEX    1557835439
TOR    1460955253
WAS     583376341
Name: salary, dtype: int64

In [14]:
#prints the sum of salaries of each team for each year they played
for item in teamID_list:
    YearTeamSalarySum = salaries_df[salaries_df['teamID']==item].groupby('yearID')['salary'].sum()
    print(item + ' ' + str(YearTeamSalarySum))

BAL yearID
1985    11560712
1986    13001258
1987    13900273
1988    13532075
1989     8275167
1990     9680084
1991    17519000
1992    23780667
1993    29096500
1994    38849769
1995    43942521
1996    54490315
1997    58516400
1998    72355634
1999    80605863
2000    81447435
2001    67599540
2002    60493487
2003    73877500
2004    51623333
2005    73914333
2006    72585582
2007    93174808
2008    67196246
2009    67101666
2010    81612500
2011    85304038
2012    77353999
2013    84393333
Name: salary, dtype: int64
BOS yearID
1985     10897560
1986     14402239
1987     10144167
1988     13896092
1989     17481748
1990     20558333
1991     35167500
1992     43610584
1993     37120583
1994     37859084
1995     32455518
1996     42393500
1997     43558750
1998     56757000
1999     63497500
2000     77940333
2001    110035833
2002    108366060
2003     99946500
2004    127298500
2005    123505125
2006    120099824
2007    143026214
2008    133390035
2009    121345999
2010    162447333
2011    161762475
2012    173186617
2013    151530000
Name: salary, dtype: int64
CAL yearID
1985    14427894
1986    14427258
1987    12843499
1988    11947388
1989    15097833
1990    21720000
1991    33060001
1992    34749334
1993    28588334
1994    25156218
1995    31223171
1996    28738000
Name: salary, dtype: int64
CHA yearID
1985      9846178
1986     10418819
1987     10641843
1988      6390000
1989      7265410
1990      9491500
1991     16919667
1992     30160833
1993     39696166
1994     39183836
1995     46961282
1996     45139500
1997     57740000
1998     38335000
1999     25620000
2000     31133500
2001     65653667
2002     57052833
2003     51010000
2004     65212500
2005     75178000
2006    102750667
2007    108671833
2008    121189332
2009     96068500
2010    105530000
2011    127789000
2012     96919500
2013    120065277
Name: salary, dtype: int64
CLE yearID
1985     6551666
1986     7809500
1987     8513750
1988     8936500
1989     9094500
1990    14487000
1991    17635000
1992     9373044
1993    18561000
1994    30490500
1995    37937835
1996    48107360
1997    56802460
1998    60800166
1999    72978462
2000    75880771
2001    93152001
2002    78909449
2003    48584834
2004    34319300
2005    41502500
2006    56031500
2007    61673267
2008    78970066
2009    81579166
2010    61203966
2011    48776566
2012    78430300
2013    75771800
Name: salary, dtype: int64
DET yearID
1985     10348143
1986     12335714
1987     12122881
1988     12869571
1989     15146404
1990     17593238
1991     23838333
1992     27322834
1993     38150165
1994     41446501
1995     37044168
1996     23438000
1997     17272000
1998     24065000
1999     36489666
2000     58265167
2001     53416167
2002     55048000
2003     49168000
2004     46832000
2005     69092000
2006     82612866
2007     94800369
2008    137685196
2009    115085145
2010    122864928
2011    105700231
2012    132300000
2013    145989500
Name: salary, dtype: int64
KCA yearID
1985     9321179
1986    13043698
1987    11828056
1988    14556562
1989    18683568
1990    23361084
1991    26319834
1992    33893834
1993    41346167
1994    40541334
1995    29532834
1996    20281250
1997    34655000
1998    36862500
1999    26225000
2000    23433000
2001    35422500
2002    47257000
2003    40518000
2004    47609000
2005    36881000
2006    47294000
2007    67116500
2008    58245500
2009    70519333
2010    71405210
2011    35712000
2012    60916225
2013    80091725
Name: salary, dtype: int64
MIN yearID
1985      5764821
1986      8748167
1987      6397500
1988     12462666
1989     15531666
1990     14602000
1991     23361833
1992     28027834
1993     28217933
1994     28438500
1995     25410500
1996     23117000
1997     34072500
1998     27927500
1999     21257500
2000     16519500
2001     24130000
2002     40425000
2003     55505000
2004     53585000
2005     56186000
2006     63396006
2007     71439500
2008     56932766
2009     65299266
2010     97559166
2011    112737000
2012     94085000
2013     75337500
Name: salary, dtype: int64
ML4 yearID
1985    11284107
1986     9943642
1987     7293224
1988     8402000
1989    11533000
1990    19719167
1991    23115500
1992    31013667
1993    23806834
1994    24350500
1995    17798825
1996    21730000
1997    23655338
Name: salary, dtype: int64
NYA yearID
1985     14238204
1986     18494253
1987     17099714
1988     19441152
1989     17114375
1990     20912318
1991     27344168
1992     37543334
1993     42624900
1994     45731334
1995     48874851
1996     54191792
1997     62241545
1998     66806867
1999     86734359
2000     92338260
2001    112287143
2002    125928583
2003    152749814
2004    184193950
2005    208306817
2006    194663079
2007    189259045
2008    207896789
2009    201449189
2010    206333389
2011    202275028
2012    196522289
2013    231978886
Name: salary, dtype: int64
OAK yearID
1985     9058606
1986     9779421
1987    11680839
1988     9690000
1989    15613070
1990    19887501
1991    36999167
1992    41035000
1993    37812333
1994    34172500
1995    37739225
1996    21243000
1997    24018500
1998    21303000
1999    24431833
2000    31971333
2001    33810750
2002    40004167
2003    50260834
2004    59425667
2005    55425762
2006    62243079
2007    79366940
2008    47967126
2009    61910000
2010    55254900
2011    66536500
2012    55372500
2013    60132500
Name: salary, dtype: int64
SEA yearID
1985      4613000
1986      5958309
1987      2263500
1988      7342450
1989      9779500
1990     12553667
1991     15691833
1992     23179833
1993     32696333
1994     29228500
1995     36481311
1996     41328501
1997     41540661
1998     54087036
1999     54125003
2000     58915000
2001     74720834
2002     80282668
2003     86959167
2004     81515834
2005     87754334
2006     87959833
2007    106460833
2008    117666482
2009     98904166
2010     86510000
2011     86110600
2012     81978100
2013     74005043
Name: salary, dtype: int64
TEX yearID
1985      7676500
1986      6743119
1987       880000
1988      5342131
1989     11893781
1990     14874372
1991     18224500
1992     30128167
1993     36376959
1994     32973597
1995     34581451
1996     39041528
1997     53448838
1998     56572095
1999     76709931
2000     70795921
2001     88633500
2002    105526122
2003    103491667
2004     55050417
2005     55849000
2006     68228662
2007     68318675
2008     67712326
2009     68178798
2010     55250544
2011     92299264
2012    120510974
2013    112522600
Name: salary, dtype: int64
TOR yearID
1985      8812550
1986     12611047
1987     10479501
1988     12241225
1989     16261666
1990     17756834
1991     19902417
1992     44788666
1993     47279166
1994     43433668
1995     50590000
1996     29555083
1997     47079833
1998     51376000
1999     45444333
2000     44838332
2001     76895999
2002     76864333
2003     51269000
2004     50017000
2005     45719500
2006     71365000
2007     81942800
2008     97793900
2009     80538300
2010     62234000
2011     62567800
2012     75009200
2013    126288100
Name: salary, dtype: int64
ATL yearID
1985     14807000
1986     17102786
1987     16544560
1988     12728174
1989     11112334
1990     14555501
1991     18403500
1992     34625333
1993     41641417
1994     49383513
1995     47235445
1996     49698500
1997     52278500
1998     61186000
1999     73140000
2000     84537836
2001     91936166
2002     92870367
2003    106243667
2004     90182500
2005     86457302
2006     90156876
2007     87290833
2008    102365683
2009     96726166
2010     84423666
2011     87002692
2012     82829942
2013     87871525
Name: salary, dtype: int64
CHN yearID
1985     12702917
1986     17208165
1987     14307999
1988     13119198
1989     10668000
1990     13624000
1991     23175667
1992     29829686
1993     39386666
1994     36287333
1995     29505834
1996     33081000
1997     42155333
1998     50838000
1999     62343000
2000     60539333
2001     64715833
2002     75690833
2003     79868333
2004     90560000
2005     87032933
2006     94424499
2007     99670332
2008    118345833
2009    134809000
2010    146609000
2011    125047329
2012     88197033
2013    100567726
Name: salary, dtype: int64
CIN yearID
1985      8359917
1986     11906388
1987      9281500
1988      8888409
1989     11072000
1990     14370000
1991     26305333
1992     35931499
1993     44879666
1994     40961833
1995     43144670
1996     42526334
1997     49768000
1998     23005000
1999     33962761
2000     46867200
2001     48986000
2002     45050390
2003     59355667
2004     46615250
2005     61892583
2006     60909519
2007     68524980
2008     74117695
2009     73558500
2010     71761542
2011     75947134
2012     82203616
2013    106404462
Name: salary, dtype: int64
HOU yearID
1985      9993051
1986      9873276
1987     12608371
1988     12286167
1989     15029500
1990     18330000
1991     12852500
1992     15407500
1993     30210500
1994     33126000
1995     34169834
1996     28487000
1997     34777500
1998     42374000
1999     54914000
2000     51289111
2001     60612667
2002     63448417
2003     71040000
2004     75397000
2005     76779000
2006     88694435
2007     87759000
2008     88930414
2009    102996414
2010     92355500
2011     70694000
2012     60651000
2013     17890700
Name: salary, dtype: int64
LAN yearID
1985     10967917
1986     14913776
1987     13675403
1988     16850515
1989     21071562
1990     21318704
1991     32790664
1992     44788166
1993     39331999
1994     38000001
1995     39273201
1996     35355000
1997     45380304
1998     48820000
1999     80862453
2000     87924286
2001    109105953
2002     94850953
2003    105572620
2004     92902001
2005     83039000
2006     98447187
2007    108454524
2008    118588536
2009    100414592
2010     95358016
2011    104188999
2012     95143575
2013    223362196
Name: salary, dtype: int64
MON yearID
1985     9470166
1986    11103600
1987     6942052
1988     9603333
1989    13807389
1990    16586388
1991    10732333
1992    15822334
1993    18899333
1994    19098000
1995    12364000
1996    16264500
1997    19295500
1998    10641500
1999    17903000
2000    32994333
2001    35159500
2002    38670500
2003    51948500
2004    40897500
Name: salary, dtype: int64
NYN yearID
1985     10834762
1986     15393714
1987     13846714
1988     15269314
1989     19885071
1990     21722834
1991     32590001
1992     44602002
1993     39043667
1994     30956583
1995     27674992
1996     24479500
1997     39800400
1998     52077999
1999     65092092
2000     79509776
2001     93174428
2002     94633593
2003    116876429
2004     96660970
2005    101305821
2006    101084963
2007    115231663
2008    137793376
2009    149373987
2010    134422942
2011    118847309
2012     93353983
2013     49448346
Name: salary, dtype: int64
PHI yearID
1985     10124966
1986     11590166
1987     11514233
1988     13838000
1989     10604000
1990     13173667
1991     22487332
1992     24383834
1993     28538334
1994     31599000
1995     30555945
1996     34314500
1997     36656500
1998     36297500
1999     31692500
2000     47308000
2001     41663833
2002     57954999
2003     70780000
2004     92919167
2005     95522000
2006     88273333
2007     89428213
2008     97879880
2009    113004046
2010    141928379
2011    172976379
2012    174538938
2013    169863189
Name: salary, dtype: int64
PIT yearID
1985     9227500
1986    10843500
1987     7652000
1988     5998500
1989    12737500
1990    15556000
1991    23634667
1992    33944167
1993    24822467
1994    24217250
1995    18355345
1996    23017500
1997    10771667
1998    15065000
1999    24697666
2000    28928334
2001    57760833
2002    42323599
2003    54812429
2004    32227929
2005    38133000
2006    46717750
2007    38537833
2008    48689783
2009    48693000
2010    34943000
2011    45047000
2012    62951999
2013    77062000
Name: salary, dtype: int64
SDN yearID
1985    11036583
1986    11380693
1987    11065796
1988     9561002
1989    14195000
1990    17588334
1991    22150001
1992    26854167
1993    25511333
1994    14916333
1995    26382334
1996    28348172
1997    37363672
1998    46861500
1999    49768179
2000    54821000
2001    39182833
2002    41425000
2003    45210000
2004    55384833
2005    63290833
2006    69896141
2007    58110567
2008    73677616
2009    43333700
2010    37799300
2011    45869140
2012    55244700
2013    65585500
Name: salary, dtype: int64
SFN yearID
1985      8221714
1986      8947000
1987      7290000
1988     12380000
1989     14962834
1990     19335333
1991     30967666
1992     33163168
1993     35050000
1994     42638666
1995     36462777
1996     37144725
1997     35592378
1998     42565834
1999     46595057
2000     53737826
2001     63280167
2002     78299835
2003     82852167
2004     82019166
2005     90199500
2006     90056419
2007     90219056
2008     76594500
2009     83026450
2010     98641333
2011    118198333
2012    117620683
2013    140180334
Name: salary, dtype: int64
SLN yearID
1985     11817083
1986      9875010
1987     11758000
1988     12880000
1989     16078833
1990     20523334
1991     21860001
1992     27583836
1993     23367334
1994     29275601
1995     37101000
1996     40269667
1997     45456667
1998     54672521
1999     49778195
2000     61453863
2001     78538333
2002     74660875
2003     83786666
2004     83228333
2005     92106833
2006     88891371
2007     90286823
2008     99624449
2009     88528409
2010     93540751
2011    105433572
2012    110300862
2013     92260110
Name: salary, dtype: int64
COL yearID
1993    10353500
1994    23887333
1995    34154717
1996    40179823
1997    43559667
1998    50484648
1999    61935837
2000    61111190
2001    71541334
2002    56851043
2003    67179667
2004    65445167
2005    47839000
2006    41233000
2007    54041000
2008    68655500
2009    75201000
2010    84227000
2011    88148071
2012    78069571
2013    74409071
Name: salary, dtype: int64
FLO yearID
1993    19330545
1994    21633000
1995    24515781
1996    31022500
1997    48692500
1998    41322667
1999    21085000
2000    19872000
2001    35762500
2002    41979917
2003    49450000
2004    42143042
2005    60408834
2006    14671500
2007    30507000
2008    21811500
2009    36834000
2010    57029719
2011    56944000
Name: salary, dtype: int64
ANA yearID
1997     31135472
1998     41281000
1999     55388166
2000     51464167
2001     47535167
2002     61721667
2003     79031667
2004    100534667
Name: salary, dtype: int64
TBA yearID
1998    27280000
1999    38870000
2000    62765129
2001    56980000
2002    34380000
2003    19630000
2004    29556667
2005    29679067
2006    34917967
2007    24123500
2008    43820597
2009    63313034
2010    71923471
2011    41053571
2012    64173500
2013    52955272
Name: salary, dtype: int64
ARI yearID
1998     32347000
1999     68703999
2000     81027833
2001     85082999
2002    102819999
2003     80657000
2004     69780750
2005     62329166
2006     59684226
2007     52067546
2008     66202712
2009     73115666
2010     60718166
2011     53639833
2012     73804833
2013     90132000
Name: salary, dtype: int64
MIL yearID
1998    33914904
1999    43377395
2000    36505333
2001    43886833
2002    50287833
2003    40627000
2004    27528500
2005    39934833
2006    57568333
2007    70986500
2008    80937499
2009    80182502
2010    81108278
2011    85497333
2012    97653944
2013    76947033
Name: salary, dtype: int64
LAA yearID
2005     94867822
2006    103472000
2007    109251333
2008    119216333
2009    113709000
2010    104963866
2011    138543166
2012    154485166
2013    124174750
Name: salary, dtype: int64
WAS yearID
2005     48581500
2006     63143000
2007     36947500
2008     54961000
2009     59928000
2010     61400000
2011     63856928
2012     80855143
2013    113703270
Name: salary, dtype: int64
MIA yearID
2012    118078000
2013     33601900
Name: salary, dtype: int64

In [17]:
print(team_df['W'].head(10))

0    21
1    19
2    20
3    15
4    16
5    13
6     7
7    10
8     4
9    39
Name: W, dtype: int64

In [19]:
#printing the sum of wins by each team
print(team_df.groupby('teamID')['W'].sum())

teamID
ALT       6
ANA     664
ARI    1291
ATL    3960
BAL    4864
BFN     314
BFP      36
BL1      78
BL2     403
BL3      86
BL4       0
BLA     118
BLF     131
BLN     644
BLU      58
BOS    9075
BR1       3
BR2      50
BR3     410
BR4      26
BRF     147
BRO    5214
BRP      76
BS1     225
BS2      93
BSN    5118
BSP      81
BSU      58
BUF     154
CAL    2440
       ...
SL3      73
SL4     781
SL5      79
SLA    3414
SLF     149
SLN    9600
SLU      94
SPU       2
SR1      22
SR2      55
TBA    1195
TEX    3287
TL1      46
TL2      68
TOR    2902
TRN     134
TRO      28
WAS    1086
WIL       2
WOR      90
WS1    4223
WS2     740
WS3      17
WS4       0
WS5       8
WS6       5
WS7      12
WS8     163
WS9      44
WSU      47
Name: W, Length: 149, dtype: int64

In [23]:
#pd.concat([salaries_df,team_df],axis=1)
win_series = team_df.groupby('teamID')['W'].sum()
print(win_series.head(5))
print(type(win_series))

teamID
ALT       6
ANA     664
ARI    1291
ATL    3960
BAL    4864
Name: W, dtype: int64
<class 'pandas.core.series.Series'>

In [25]:
#pd.concat([salaries_df,win_series])
win_series.name = 'WINS'
variable_added = DataFrame.join(salaries_df,win_series)
print(variable_added)

       yearID teamID lgID   playerID    salary  WINS
0        1985    BAL   AL  murraed02   1472819   NaN
1        1985    BAL   AL   lynnfr01   1090000   NaN
2        1985    BAL   AL  ripkeca01    800000   NaN
3        1985    BAL   AL   lacyle01    725000   NaN
4        1985    BAL   AL  flanami01    641667   NaN
5        1985    BAL   AL  boddimi01    625000   NaN
6        1985    BAL   AL  stewasa01    581250   NaN
7        1985    BAL   AL  martide01    560000   NaN
8        1985    BAL   AL  roeniga01    558333   NaN
9        1985    BAL   AL  mcgresc01    547143   NaN
10       1985    BAL   AL  dempsri01    512500   NaN
11       1985    BAL   AL  grosswa01    483333   NaN
12       1985    BAL   AL  dauerri01    480000   NaN
13       1985    BAL   AL   fordda01    450000   NaN
14       1985    BAL   AL  martiti01    440000   NaN
15       1985    BAL   AL  davisst02    437500   NaN
16       1985    BAL   AL  dwyerji01    375000   NaN
17       1985    BAL   AL  nolanjo01    341667   NaN
18       1985    BAL   AL  shelbjo01    130000   NaN
19       1985    BAL   AL  rayfofl01    128500   NaN
20       1985    BAL   AL  youngmi01    121000   NaN
21       1985    BAL   AL  sheetla01     60000   NaN
22       1985    BOS   AL  stanlbo01   1075000   NaN
23       1985    BOS   AL  boggswa01   1000000   NaN
24       1985    BOS   AL  armasto01    915000   NaN
25       1985    BOS   AL  evansdw01    800000   NaN
26       1985    BOS   AL   riceji01    779227   NaN
27       1985    BOS   AL  bucknbi01    747500   NaN
28       1985    BOS   AL  easlemi01    650000   NaN
29       1985    BOS   AL  clearma01    580000   NaN
...       ...    ...  ...        ...       ...   ...
23926    2013    SLN   NL  cletoma01    490000   NaN
23927    2013    SLN   NL  jacksry02    490000   NaN
23928    2013    SLN   NL  kozmape01    490000   NaN
23929    2013    SLN   NL  millesh01    490000   NaN
23930    2013    SLN   NL  rosentr01    490000   NaN
23931    2013    WAS   NL  werthja01  16571429   NaN
23932    2013    WAS   NL  zimmery01  14100000   NaN
23933    2013    WAS   NL  harenda01  13000000   NaN
23934    2013    WAS   NL  soriara01  11742091   NaN
23935    2013    WAS   NL  larocad01  10000000   NaN
23936    2013    WAS   NL  suzukku01   6487500   NaN
23937    2013    WAS   NL  gonzagi01   6350000   NaN
23938    2013    WAS   NL  zimmejo02   5350000   NaN
23939    2013    WAS   NL   spande01   4750000   NaN
23940    2013    WAS   NL  clippty01   4000000   NaN
23941    2013    WAS   NL  strasst01   3900000   NaN
23942    2013    WAS   NL  desmoia01   3800000   NaN
23943    2013    WAS   NL  storedr01   2500000   NaN
23944    2013    WAS   NL  detwiro01   2337500   NaN
23945    2013    WAS   NL  harpebr03   2000000   NaN
23946    2013    WAS   NL  bernaro01   1212500   NaN
23947    2013    WAS   NL  tracych01   1000000   NaN
23948    2013    WAS   NL  stammcr01    875000   NaN
23949    2013    WAS   NL   dukeza01    700000   NaN
23950    2013    WAS   NL  espinda01    526250   NaN
23951    2013    WAS   NL  matthry01    504500   NaN
23952    2013    WAS   NL  lombast02    501250   NaN
23953    2013    WAS   NL  ramoswi01    501250   NaN
23954    2013    WAS   NL  rodrihe03    501000   NaN
23955    2013    WAS   NL  moorety01    493000   NaN

[23956 rows x 6 columns]